import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';
import { RouterLink } from '@angular/router';

@Component({
  selector: 'app-services',
  standalone: true,
  imports: [CommonModule, RouterLink],
  templateUrl: './services.component.html',
  styleUrl: './services.component.scss',
})
export class ServicesComponent {
  // Tabs
  tabs = ['مشاريع ويب', 'أنظمة ومنصات'];
  activeTab = this.tabs[0];

  // Services
  // Services
  services: Service[] = [
    {
      id: 1,
      name: 'مواقع للمحلات والأنشطة التجارية',
      description:
        'مواقع جذابة واحترافية لأي محل أو نشاط تجاري، تعرض منتجاتك وخدماتك بشكل منظم وتزيد من مبيعاتك.',
      price: 1999,
      category: 'مشاريع ويب',
      thumbnail: 'assets/images/2.jpg',
      fullDescription:
        'موقع احترافي لأي نشاط تجاري، يعرض منتجاتك وخدماتك بطريقة منظمة وجذابة، يعزز الاطلاع على محلك، ويتيح التواصل معك بسهولة، مع خريطة الموقع لسهولة الوصول.',
      deliverables: [
        'تصميم متجاوب',
        'عرض المنتجات والخدمات',
        'نماذج تواصل',
        'خريطة الموقع',
        'زيادة المبيعات',
      ],
      extras: [{ name: 'صفحات إضافية', price: 500 }],
    },
    {
      id: 2,
      name: 'مواقع شخصية للمطاعم',
      description:
        'موقع عصري للمطاعم يعرض المنيو، العروض، ويزيد من الطلبات والمبيعات.',
      price: 1999,
      category: 'مشاريع ويب',
      thumbnail: 'assets/images/restaurant/restaurant_1.jpg',
      fullDescription:
        'موقع مطعم احترافي يعرض المنيو الرقمي، صور الأطباق، العروض الخاصة، ويزيد الاطلاع على المطعم، ويسهّل التواصل مع العملاء وحجز الطلبات أونلاين، مع خريطة الموقع.',
      deliverables: [
        'منيو رقمي',
        'معرض صور',
        'حجز أو طلب أونلاين',
        'موقع على الخريطة',
        'زيادة المبيعات',
      ],
      extras: [{ name: 'نظام طلب أونلاين', price: 700 }],
    },
    {
      id: 3,
      name: 'مواقع شخصية للكافيهات',
      description:
        'موقع أنيق للكافيهات يعرض المنيو والعروض ويزيد من عدد زوارك ومبيعاتك.',
      price: 1999,
      category: 'مشاريع ويب',
      thumbnail: 'assets/images/coffe/coffe_1.jpg',
      fullDescription:
        'موقع كافيه احترافي يعرض المنيو الرقمي، صور المكان والمشروبات، العروض اليومية، ويسهّل التواصل مع الزوار، مع خريطة الموقع، ويزيد الاطلاع على الكافيه وعدد زواره.',
      deliverables: [
        'منيو رقمي',
        'صور المكان والمشروبات',
        'حجز أونلاين',
        'عرض العروض اليومية',
        'خريطة الموقع',
        'زيادة المبيعات',
      ],
      extras: [{ name: 'تصميم مخصص للقوائم', price: 500 }],
    },
    {
      id: 4,
      name: 'مواقع شخصية للمهنيين',
      description:
        'موقع احترافي للأطباء، المدرسين، المهندسين، المحامين، وأصحاب المهن الحرة لزيادة الاطلاع والتواصل.',
      price: 1499,
      category: 'مشاريع ويب',
      thumbnail: 'assets/images/4.jpg',
      fullDescription:
        'موقع شخصي عصري يعرض السيرة الذاتية، التخصصات، الخدمات، شهادات العملاء، ويسهّل التواصل معك بسهولة، مع إمكانية عرض موقع المكتب أو مقر العمل على الخريطة، ويزيد الاطلاع على خدماتك ومهنيتك.',
      deliverables: [
        'ملف شخصي احترافي',
        'عرض الخدمات والتخصصات',
        'نماذج حجز أو تواصل',
        'خريطة الموقع',
        'زيادة الاطلاع والمبيعات',
      ],
      extras: [{ name: 'صفحات إضافية', price: 400 }],
    },
    {
      id: 5,
      name: 'مواقع شخصية لشركات والمؤسسات',
      description:
        'موقع رسمي للشركات يعرض خدماتها، أعمالها، ويزيد من المبيعات والتواصل.',
      price: 1499,
      category: 'مشاريع ويب',
      thumbnail: 'assets/images/21.jpg',
      fullDescription:
        'موقع احترافي للشركات والمؤسسات يشمل عرض الخدمات، معرض الأعمال، الفريق، شهادات العملاء، ويتيح التواصل السهل مع العملاء، ويزيد الاطلاع والمبيعات، مع خريطة الموقع.',
      deliverables: [
        'عرض الخدمات',
        'معرض الأعمال',
        'قسم الفريق',
        'نماذج تواصل',
        'خريطة الموقع',
        'زيادة المبيعات',
      ],
      extras: [{ name: 'صفحات إضافية', price: 600 }],
    },

    {
      id: 6,
      name: 'ERP نظام متكامل وذكي',
      description:
        'منصة شاملة لإدارة جميع أقسام الشركة أو المؤسسة: المحاسبة، المخزون، الموارد البشرية، المبيعات، والتقارير، لتحسين الكفاءة والرقابة.',
      price: 2999,
      category: 'أنظمة ومنصات',
      thumbnail: 'assets/images/17.jpg',
      fullDescription:
        'نطور أنظمة ERP ومنصات رقمية لإدارة الأعمال، تشمل العيادات، المستشفيات، الشركات، المحلات، الهايبر ماركت، والمنصات التعليمية حسب احتياجك.',
      deliverables: [
        'نظام متعدد الوحدات',
        'إدارة المستخدمين',
        'تقارير ذكية',
        'أمان وصلاحيات',
      ],
      extras: [{ name: 'تقارير متقدمة', price: 1000 }],
    },

    {
      id: 8,
      name: 'منصة تعليمية متكاملة',
      description:
        'حل متكامل لإدارة الدروس، الطلاب، المعلمين، المحتوى التعليمي، والاختبارات، مع تجربة مستخدم سلسة للطلاب والمعلمين على حد سواء.',
      price: 2999,
      category: 'أنظمة ومنصات',
      thumbnail: 'assets/images/16.jpg',
      fullDescription:
        'منصة تعليمية مناسبة للمدرسين والسناتر التعليمية، تشمل إدارة الكورسات، رفع الفيديوهات، تسجيل الطلاب، متابعة التقدم، والاختبارات.',
      deliverables: [
        'إدارة الكورسات',
        'حسابات طلاب',
        'رفع فيديوهات',
        'متابعة التقدم',
      ],
      extras: [{ name: 'نظام امتحانات', price: 1000 }],
    },

    {
      id: 10,
      name: 'نظام إدارة نوادي ',
      description:
        'حل رقمي متكامل لإدارة النوادي، يشمل العضويات، الجداول، الموظفين، الخدمات، والتقارير المالية، مع واجهة  تسهّل متابعة الأداء وتحسين تجربة العملاء.',
      price: 2999,
      category: 'أنظمة ومنصات',
      thumbnail: 'assets/images/19.jpg',
      fullDescription:
        'نظام ذكي لإدارة الكافيهات يشمل إدارة الاشتراكات، الحجوزات، الطلبات، الموظفين، والتقارير اليومية.',
      deliverables: ['إدارة الاشتراكات', 'حجوزات', 'إدارة الطلبات', 'تقارير'],
      extras: [{ name: 'تطبيق موبايل', price: 2000 }],
    },
    {
      id: 11,
      name: 'نظام إدارة مستشفيات',
      description:
        'تحكّم كامل في عمليات المستشفى من خلال نظام ذكي يربط المرضى، الأطباء، والمواعيد في منصة واحدة سهلة الاستخدام.',
      price: 3999,
      category: 'أنظمة ومنصات',
      thumbnail: 'assets/images/13.jpg',
      fullDescription:
        'نظام إدارة مستشفيات شامل يساعدك على تنظيم العمل الطبي بكفاءة عالية، من استقبال المرضى إلى إدارة الأقسام، الأطباء، التمريض، والسجلات الطبية مع تقارير دقيقة.',
      deliverables: [
        'إدارة المرضى والسجلات الطبية',
        'إدارة الأقسام الطبية',
        'حسابات الأطباء والتمريض',
        'نظام مواعيد متقدم',
        'تقارير وإحصائيات',
      ],
      extras: [
        { name: 'بوابة المرضى', price: 1500 },
        { name: 'نظام صيدلية', price: 1200 },
      ],
    },
    {
      id: 12,
      name: 'نظام إدارة كافيهات',
      description:
        'منصة متكاملة لتنظيم الحجوزات، الطلبات، الاشتراكات، الموظفين، والتقارير اليومية بكفاءة عالية لتقديم تجربة سلسة للعملاء.',
      price: 2999,
      category: 'أنظمة ومنصات',
      thumbnail: 'assets/images/14.jpg',
      fullDescription:
        'نظام مخصص لإدارة الكافيهات يشمل الطلبات، الطاولات، الموظفين، والمبيعات اليومية، مع تقارير تساعدك على متابعة الأداء وزيادة الأرباح.',
      deliverables: [
        'إدارة الطلبات والطاولات',
        'إدارة الموظفين',
        'حساب الفواتير',
        'تقارير يومية وشهرية',
      ],
      extras: [
        { name: 'ربط كاشير POS', price: 1000 },
        { name: 'تطبيق طلبات للزبائن', price: 2000 },
      ],
    },
    {
      id: 13,
      name: 'نظام متكامل لإدارة المطاعم',
      description:
        'منصة  شاملة لإدارة المطعم بكل سهولة، تشمل المنيو الرقمي، الطلبات، الموظفين، التقارير اليومية، والمحاسبة المالية في مكان واحد لتعزيز الكفاءة وزيادة الأرباح.',
      price: 2999,
      category: 'أنظمة ومنصات',
      thumbnail: 'assets/images/28.jpg',
      fullDescription:
        'نظام إدارة مطاعم متكامل يساعدك على تنظيم الطلبات، المطبخ، التوصيل، المخزون، والمبيعات بشكل سلس وسريع.',
      deliverables: [
        'إدارة الطلبات الداخلية والتوصيل',
        'شاشة المطبخ',
        'إدارة المنيو',
        'تقارير المبيعات',
      ],
      extras: [
        { name: 'تطبيق توصيل', price: 2500 },
        { name: 'إدارة المخزون', price: 1200 },
      ],
    },
    {
      id: 9,
      name: 'نظام إدارة عيادات ',
      description:
        'سيستم متكامل لإدارة المرضى، الأطباء، والمواعيد ، والامور المالية.',
      price: 2999,
      category: 'أنظمة ومنصات',
      thumbnail: 'assets/images/15.jpg',
      fullDescription:
        'نظام احترافي لإدارة العيادات والمستشفيات يشمل تسجيل المرضى، حجز المواعيد، ملفات طبية، إدارة الأطباء، والتقارير.',
      deliverables: ['إدارة المرضى', 'حجز المواعيد', 'ملفات طبية', 'تقارير'],
      extras: [{ name: 'بوابة مرضى', price: 1200 }],
    },
    {
      id: 14,
      name: 'لوحات التحكم الاحترافية',
      description:
        'لوحة تحكم مركزية لإدارة جميع بياناتك، المستخدمين، والمحتوى بسهولة وذكاء.',
      price: 1999,
      category: 'مشاريع ويب',
      thumbnail: 'assets/images/26.jpg',
      fullDescription:
        'لوحة تحكم احترافية لإدارة المواقع أو التطبيقات، تشمل إدارة المستخدمين، المحتوى، التقارير، والإشعارات بطريقة ذكية وسهلة الاستخدام، وتساعد على زيادة متابعة العملاء وتحسين الأداء العام.',
      deliverables: [
        'إدارة المستخدمين',
        'إدارة المحتوى',
        'تقارير ورسوم بيانية',
        'إشعارات',
        'زيادة الاطلاع والمبيعات',
      ],
      extras: [{ name: 'تصميم مخصص للوحة التحكم', price: 700 }],
    },
    {
      id: 7,
      name: 'موقع شخصي مخصص (Custom)',
      description:
        'موقع شخصي مصمم خصيصًا لعرض أعمالك ومشاريعك بطريقة جذابة، لزيادة الاطلاع والتواصل مع عملائك بسهولة.',
      price: 1499,
      category: 'مشاريع ويب',
      thumbnail: 'assets/images/6.jpg',
      fullDescription:
        'موقع بورتفوليو عصري لعرض الأعمال والمشاريع الشخصية، يشمل معرض أعمال، وصف المشاريع، روابط تواصل، ويزيد الاطلاع على مهاراتك وخدماتك، مع إمكانية عرض موقع المكتب على الخريطة.',
      deliverables: [
        'معرض أعمال',
        'عرض المشاريع',
        'نماذج تواصل',
        'خريطة الموقع',
        'زيادة الاطلاع',
      ],
      extras: [{ name: 'تصميم مخصص للبورتفوليو', price: 400 }],
    },
  ];

  selectedService: Service | null = null;

  selectTab(tab: string) {
    this.activeTab = tab;
  }

  get filteredServices() {
    return this.services.filter((s) => s.category === this.activeTab);
  }
}

export interface ServiceExtra {
  name: string;
  price: number;
}

export interface Service {
  id: number;
  name: string;
  description: string;
  price: number;
  category: string;
  thumbnail: string;
  fullDescription: string;
  deliverables: string[];
  extras: ServiceExtra[];
}
